######example for values #######
#addi $t5,$0,5
#sw $t5,0($t1)
#addi $t6,$0,70000
#sw $t6,28($t1)
#addi $t7,$0,3
#sw $t7,32($t1)
################################


la $t1,0X10010000
addi $t0,$0,1 #מקדם 8 פעמים את הלולאה
While:
	lw $s0,0($t1) #שם בערך s0 את הערך של הכתובת
	beq $t0,9,End #אם שווה ל9 צא מהלולאה
	mult $s0,$s0 #ריבוע הערך בכתובת
	mflo $s1 #שמירת הערך מהמכפלה lo
	mfhi $s2 #שמירה הערך מהמכפלה hi
	add $t3,$t3,$s2 #הוספה לסכום של הhi-ים
	add $t4,$t4,$s1 #הוספה לסכום של הlo-ים
	addi $t0,$t0,1 #קידום ב1
	addi $t1,$t1,4 #קידום הכתובת ב4
	J While #תחזור לתחילת הלולאה
End: #סוף



	
	
	
	
